
 window.addEventListener('load', function() {
    var allElements = document.getElementsByTagName('*');
      Array.prototype.forEach.call(allElements, function(el){
        var includePath = el.dataset.includePath;
        if (includePath){
          var xhttp=new XMLHttpRequest();
          xhttp.onreadystatechange = function(){
              if (this.readyState == 4 && this.status == 200){
                  el.outerHTML=this.responseText;
              }
          };
          xhttp.open('GET', includePath, true);
          xhttp.send();
      }
    });
   }); 

  /////////////////////////////////// util ///////////////////////////////////////////////////////////////////////////////////////////
  function strToDate(str) { 
    let dateString = str;
    if(str.indexOf('-') < 0 && str.length === 12 && !isNaN(Number(str)))
        dateString = str.slice(0,4) +'-'+ str.slice(4,6) + '-' + str.slice(6,8) + ' ' + str.slice(8,10) + ':' + str.slice(10,12);
  
    return !isNaN(Date.parse(dateString))? new Date(dateString) : null;
    }
  
  function dateToStr(date){
    if(isNaN(Date.parse(date))) return '';
  
    let month = date.getMonth() + 1;
    let day = date.getDate();
    let hour = date.getHours();
    let minute = date.getMinutes();
    //let second = date.getSeconds();
  
    month = month >= 10 ? month : '0' + month;
    day = day >= 10 ? day : '0' + day;
    hour = hour >= 10 ? hour : '0' + hour;
    minute = minute >= 10 ? minute : '0' + minute;
    //second = second >= 10 ? second : '0' + second;
  
    return date.getFullYear() + '-' + month + '-' + day + ' ' + hour + ':' + minute;
  }

  function dateToStrCharacterLength(date, character, length){
    if(isNaN(Date.parse(date))) return '';
  
    let month = date.getMonth() + 1;
    let day = date.getDate();
    let hour = date.getHours();
    let minute = date.getMinutes();
    //let second = date.getSeconds();
  
    month = month >= 10 ? month : '0' + month;
    day = day >= 10 ? day : '0' + day;
    hour = hour >= 10 ? hour : '0' + hour;
    minute = minute >= 10 ? minute : '0' + minute;
    //second = second >= 10 ? second : '0' + second;
  
    return (date.getFullYear() + character + month + character + day + ' ' + hour + ':' + minute).substring(0, length);
  }
  
  function dateToNumber(date){
    if(isNaN(Date.parse(date))) return '';
  
    let month = date.getMonth() + 1;
    let day = date.getDate();
    let hour = date.getHours();
    let minute = date.getMinutes();
    //let second = date.getSeconds();
  
    month = month >= 10 ? month : '0' + month;
    day = day >= 10 ? day : '0' + day;
    hour = hour >= 10 ? hour : '0' + hour;
    minute = minute >= 10 ? minute : '0' + minute;
    //second = second >= 10 ? second : '0' + second;
  
    let str = date.getFullYear().toString() + month.toString() +  day.toString() + hour.toString() +  minute.toString();
    return parseInt(str);
  }  
  
  function dateToStrHhmm(date){
    if(isNaN(Date.parse(date))) return '';
      
    let hour = date.getHours();
    let minute = date.getMinutes();
    
    hour = hour >= 10 ? hour : '0' + hour;
    minute = minute >= 10 ? minute : '0' + minute;
    
    return hour + ':' + minute;
  }
    
  // 콤마 생성
  function numberWithCommas(x) {
    return x ? x.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ',') : 0;
  }

  function unitNumberWithCommas(x) {
    if(x >= 1 && x <= 99999){
      return x.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ',');
    }else if(x >= 100000 && x <= 999999){
      return Math.floor(x/1000) + 'K';
    }else if(x > 100000){
      return Math.floor(x/1000000) + 'M';
    }else{
      return x;
    }    
  }

  function isLeapYear (year) { 
    return (((year % 4 === 0) && (year % 100 !== 0)) || (year % 400 === 0)); 
  };

  function getDaysInMonth (year, month) {
    return [31, (isLeapYear(year) ? 29 : 28), 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month];
  };
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  function allCheck(){
    document.querySelector('#checkAll');
        const isChecked = checkAll.checked;      
        if(isChecked){
            const checkboxes = document.querySelectorAll('.chk');
    
            for(const checkbox of checkboxes){
                checkbox.checked = true;
            }
        }
        else{
            const checkboxes = document.querySelectorAll('.chk');
            for(const checkbox of checkboxes){
                checkbox.checked = false;
            }
        }
  }
  
  function itemCheck(){
    const checkboxes = document.querySelectorAll('.chk');   
    for(const checkbox of checkboxes){
            const totalCnt = checkboxes.length;        
            const checkedCnt = document.querySelectorAll('.chk:checked').length;
          
            if(totalCnt == checkedCnt){
                document.querySelector('#checkAll').checked = true;
            }
            else{
                document.querySelector('#checkAll').checked = false;
            }
    }
  }
  
  function checkOne(){
  document.querySelector('#checkAll').checked = false;
  const checkboxes = document.querySelectorAll('.chk');   
  for(const checkbox of checkboxes){
          const totalCnt = checkboxes.length;        
          const checkedCnt = document.querySelectorAll('.chk:checked').length;
        
          if (checkedCnt >1 ){
            alert('기사 하나만 check가능합니다.')
          }
  }
  }
  
  function replacestr(str){
    let _str = str[0];
    for ( let i = 0; i < str.length - 2; i++){
      
        _str += '*';
    }
    _str += str[str.length-1]
    return _str
  }

  function checkBanWord(str){
    const banWords = ["ㅄ","ㅗ","凸","뇬","븅","쉐","쉑","쉣","쉨","쌕","썅","좃","쎽","쎡","쎾","쏐","쒝","쒞","씹","젖","좇","죳","죶","후뢰","좆만","좆같","좄까","좃찐","잡넘","자슥","엿같","양놈","야설","씹질","X끼","g랄","z랄","ㄱㅐ","ㄲㅈ","ㅁㅊ","ㅂㅅ","ㅅㅂ","ㅅㅍ","ㅆㅍ","ㅆ앙","ㅈㄹ","ㅍㅏ","개뇬","개독","개랄","개뻥","개뿔","개쉐","개쉑","개쉽","개쐑","개쑈","개씹","씹넘","걔새","걔썌","걸레","고추","고츄","곧츄","곧휴","곶츄","곶휴","광뇬","구녕","구라","구멍","그년","까러","깔어","껃여","껃져","껒여","꼬봉","꼬추","꼬츄","꼳츄","꼳휴","꼽냐","꼽다","꽂추","꽂츄","냄비","녜미","놈현","눈깔","늬미","닥쳐","닥쵸","닭쳐","대갈","뎡신","돈놈","뒈져","뒈진","뒈질","딩시","씹같","때놈","똘기","뙈놈","뙤놈","뙨넘","뙨놈","뚜쟁","띠바","띠발","띠불","랄지","미췬","미친","씨팏","뱅마","뱅신","씨팍","씨브","불할","붕가","뷰웅","빙시","빠가","빡유","뽀찌","뽁큐","새X","새갸","새키","생쑈","샫업","샷업","세갸","쇅끼","쇡끼","쉐기","쉐리","쉐키","쉬박","쉬밸","쉬빡","쉬뻘","쉬탱","쉬팍","쉽세","쉽알","슈바","슈발","스팽","시끼","시댕","시뎅","시랄","시바","시방","시밬","시팍","심탱","십라","십세","십쌔","싶알","쌉년","씨방","쌍뇬","쌩쑈","쌰럽","쌴년","씨박","썡쇼","쎄꺄","쎄엑","쎅쓰","쒸벌","쒸뻘","쒸팔","쒸펄","쓰바","쓰박","쓰발","쓰벌","쓰파","쓰팔","씁새","씁얼","씌파","씨8","씨끼","씨댕","씨뎅","씨바","써벌","씨뱅","씨벨","씨봉","썅연","씨빠","씨앙","씨파","씨퐁","씸년","씸뇬","씹뇬","씹덕","씹쉐","씹쌔","씹이","썅녀","씹퇭","씹할","씹헐","아갈","아굴","아닥","앰창","얌마","양넘","양년","엠병","염창","옘빙","오입","왜년","왜놈","욤병","은년","을년","임마","입싸","잡것","접년","정액","조낸","조랭","조빠","조찐","존만","졸래","좁년","좁밥","좃만","좃밥","좃이","섹슈","좆또","좆이","좆찐","좇같","좇이","좋만","좌식","주글","주뎅","주디","주접","죽통","쥐롤","쥬디","지X","지롤","질싸","짜식","짜지","짜찌","쫍빱","쳐닥","촌년","촌놈","캐년","캐놈","탱구","팔럼","퍽큐","헐보","호구","후레","샥스","챵년","새끠","개눔","개색","개샥","개섹","개섺","개셃","개쇅","개쇗","개쉢","개쉨","개싘","개싴","개쌔","개쌕","개쎅","개쒜","개쒝","개쒯","개쒸","빸유","개젓","개젖","개졋","개졎","겁탈","게넘","게년","게놈","게뇬","게뇽","게눔","게색","게세","게섹","게쉐","근친","꼴려","난교","니좆","매춘","몸캠","몸켐","뮈친","빠굴","미틘","미틩","뱅쉰","뱅싄","뱡신","버즤","버지","번섹","번쌕","번쎅","변섹","변태","변퇴","병쉰","병싀","불륜","병씬","부럴","보G","뵤즤","뵤지","뵨태","뵹딱","뵹싄","뵹신","붕딱","붕딲","붕뛴","붕싄","붕신","붱신","뷍슨","뷍싄","뷍신","뷩쉬","뷩쉰","뷩싄","뷩신","븅싄","븅시","븅아","브랄","블알","븡딱","븡쉰","븡신","븽딱","븽쉬","븽슨","븽싄","븽시","븽신","빙딱","빙쉬","빙쉰","빙싀","빙싄","빠걸","빠라","빠러","보즤","빡돌","빡촌","빡큐","뺑신","뺑쒼","뺑씬","뺘큐","뻐킹","뽀개","뽀쥐","뽀쮜","뿅신","뿅씬","뿡알","쁑신","삐꾸","삥쉰","삥쒼","삥씬","삽쥘","상놈","병자","새뤼","색걸","색골","색광","색기","색꺄","색남","색녀","색마","색쑤","색쓰","색캬","색할","색햐","색히","샊꺄","샵년","샹넘","샹년","샹놈","샹늠","병싄","세뀌","세끠","세엑","세퀴","세키","섹남","섹녀","섹마","섹수","섹쉬","섹시","섹할","섹해","섹s","수간","수음","쉑수","쉑스","쉑쑤","쉑캬","스펄","십넘","십녀","십놈","십밸","십색","십쉑","십알","십질","십팔","십할","싯끼","싯빨","싯팔","싲팔","싴팔","싵팔","싶팔","싹년","쌍넌","쌍념","쌍뇸","쌍뇽","쌍뉸","쌍연","쌔꺄","쌔캬","쌔키","쌕갸","쌕걸","쌕꺄","쌕수","쌕쑤","썁색","썅넌","썅넘","쎅스","쓰불","쓰뷀","쓰블","씨뱔","씨벧","씨벵","따식","씨뷀","대딸","씹8","씹놈","씹떼","씹밸","씹벌","씹블","씹빡","씹빨","씹뻘","개족","씹쉑","씹쎄","씹쒜","씹알","씹연","개접","씹펄","씹풀","씻끼","씻발","씻벌","씻뻘","씻퐁","씾팔","앂년","앂팔","알몸","애액","앰병","야녀","야동","에믜","엿먹","오럴","옹녀","월경","육봉","윤간","윤락","음경","음란","음순","음액","음욕","자위","개셐","잡뇬","정자","젖도","젖물","젖통","조루","조털","좃나","좇까","간나","짬지","찌찌","창뇨","창뇬","챵녀","챵뇬","카섹","폰색","폰섹","폰쉑","폰쌕","폰쎅","항문","허벌","호빠","혼음","화냥","화류","좆까는","좆구녕","조가틍","자위녀","엿먹어","여물통","10새","10쉑","10스","10쌔","10쎄","10알","10창","10탱","18것","18넘","18노","18뇬","18럼","18롬","18새","18색","18섹","18쉑","18스","18아","G스팟","ass","jot","si발","wtf","zot","같은년","같은뇬","개같네","개같은","개구라","개대중","개돼중","씹새꺄","개새끼","개새키","개색기","개색끼","개색키","개색히","개섀끼","개세끼","씹새기","개쇳기","개수작","개쉐리","개쉐이","개스끼","개시키","개쌔끼","개아들","개좌식","개처럼","개허접","걔수작","걔시끼","걔시키","게색기","게색끼","그새끼","꼬우냐","꼴린다","꼽사리","눈까러","눈깔어","뉘미럴","늬미럴","니귀미","니미랄","니미럴","니미씹","니아배","니아베","니어매","니어메","니어미","닝기리","대가리","도라이","돌아이","돌은놈","되질래","뒈져라","뒈진다","뒤질래","디져라","디진다","디질래","또라이","똘아이","메친넘","메친놈","바랄년","벼엉신","붙어먹","빌어먹","삐리리","삿갓이","상넘이","상놈을","상놈의","상놈이","씨봉알","새새끼","쇼하네","쉐에기","스패킹","시궁창","시부럴","시부리","시브랄","신발끈","심발끈","십새끼","십쉐이","십스키","싸가지","싹아지","썩을놈","쎄엑스","쑤시자","씨가랭","씨바랄","씨부렁","씨부리","씨뽀랄","씨엑스","씸새끼","씹덕후","씹새리","씹스키","아갈빡","아갈이","아갈통","아구창","아구통","쌍노무","오라질","이새끼","이새키","이스끼","이스키","저새끼","젖꼭지","젖꼮찌","조까치","조쟁이","조지냐","조진다","조질래","존만한","좋같은","주글래","주데이","주뎅이","주둥이","주접떨","죽고잡","죽을래","지미랄","지스팟","짜아식","캐스끼","캐스키","캐시키","후라덜","후라들","성노예","10팔","18눔","18늠","2c8","개때꺄","개때끼","개부럴","개불알","개새리","개새야","개색꺄","개세이","개셋키","뻐어큐","개쇄끼","개쇅갸","개쇅기","개쇅꺄","개쇅끼","개쇅캬","개쇅키","개쇗기","개쇠리","개쉐끼","개쉑갸","개쉑기","개쉑꺄","개쉑끼","개쉑이","개쉑캬","개쉑키","개쉑히","개쉬끼","개싀끼","개시퀴","개십팔","개싯끼","개싯키","개쌍넘","개쌍년","개쌍놈","개쌔꺄","개쌕끼","개썅넘","개썅년","개썅놈","개썅늠","개썅연","개쐐리","개쒜끼","개쒜리","개쒝갸","개쒝기","개쒝꺄","개쒝끼","개쒝키","개쒹기","개씌끼","개씨끼","개씨팕","개씹창","개씹팔","개자슥","개조또","개조옷","개후레","개후장","게새리","게세꺄","게쉐이","게시끼","게시퀴","기엉아","기형아","꼴리는","꼴리다","네에미","니미롤","니미를","니보지","니에미","니에비","빠순이","떡치기","떡칠녀","룸섹스","매춘부","몸파는","미췬년","미친뇬","미틴뇬","밑구녕","박을께","박을년","버지물","벙어리","보오지","보지걸","보지당","보지물","보지털","보짓년","보짖물","부카케","붕시나","뷰웅신","비잉신","빠꾸리","빠도리","빠돌이","빠라조","빠라줘","빠수니","빨자좃","빨자좆","빽보지","빽자지","뽀로노","뽀르나","뽀르너","뽀르노","사까치","사창가","사카시","사카치","삿가시","삿까시","삿깟시","상노무","새에끼","샤불년","샤앙년","성관계","성매매","성섹스","성욕구","성체위","성체험","성충동","세액스","세에끼","세에쓰","섹보지","섹하자","섹하장","스와핑","십때꺄","십새꺄","십새캬","십새키","십색꺄","십색끼","십색히","십세끼","십쇄리","십쉐리","십쉑히","십시끼","십쌔꺄","십쎄끼","십씨키","십팔년","십팔련","십팔연","십할련","싸발년","싸앙넘","싸앙녀","싸앙년","싸줄께","쌍놈아","쌍뇨나","쌩보지","쌰앙넘","쌰앙녀","쌰앙년","쌰앙눔","쌰앙뉸","쓰글넘","쓰글년","쓰글놈","쓰글늠","쓰발넘","씨댕년","씨바라","씨발넘","씨벨년","씨불년","씨불얼","씨앙년","씨양년","씨이바","씨이방","씨이밸","씨이빨","씨입년","씨입뇬","씨팔년","씹딱꿍","씹때꺄","씹때끼","씹떼끼","씹새캬","씹새키","씹색꺄","씹색끼","씹색히","씹샛길","씹생알","씹세끼","씹세이","씹쉐리","씹쉐이","씹쉑히","씹쌔기","씹쌔꺄","씹쌔키","씹쎄끼","씹씨키","씹팔년","씹팔련","씹팔연","씹할련","씹할연","알몸쇼","개자싁","오나니","왕보지","우라질","육시럴","자위남","젓까는","젓나게","젓마난","젓만한","젖가튼","젖까는","젖나게","젖마난","젖만한","조까는","조까라","조까튼","조빠라","조옷나","조카툰","족가튼","좃가튼","좃같은","좃까는","좃까라","좃나게","개새꺄","개새기","죶가튼","창녀촌","처녀막","최음제","카섹스","캐세끼","큰자지","포르노","폰세엑","폰섹스","함빨자","허벌창","호로년","호로색","화양년","2c팔","ac발","좆","18","후빨","찐따","꺼져","남창","년놈","돼쌍","돼썅","등신","똘추","로리","레즈","마약","맘충","먹사","좌빨","바보","발암","보빨","보슬","븅딱","빠큐","뻐큐","아다","야갤","앰흑","옘병","왕따","운지","일베","장궤","정병","조빱","엠창","좆망","좆빨","좆창","짭새","짱깨","창놈","천치","틀딱","폭력","폭행","한남","한녀","후다","흑형","보추","병맛","메갈","갈보","ㅗㅜㅑ","강간범","개소리","김여사","김치녀","급식충","ㄴㄷㅆ","느개비","느금마","대깨문","동성애","된장녀","똥꼬충","로린이","렉카충","머저리","멍청이","보전깨","빡대갈","상폐녀","상폐년","성추행","시부랄","썩을년","씨발놈","씨방년","정신병","씹치남","씹치녀","암세포","암퇘지","야갤러","애미충","애비충","애새끼","오유충","욱일기","워마드","육시랄","이완용","인조새","일베충","자박꼼","장애인","장애자","잼민이","저능아","정박아","존만이","좆만이","좆병신","좆지랄","최순실","칭챙총","트페미","피싸개","한남충","한녀충","화냥년","씨브랄","씨방놈","성행위","성폭력","상폐놈","빨갱이","빠돼쌍","보이루","따까리","군무새","가위충","버닝썬","버닝선","n번방","엔번방","알중","조두순","천주교","개신교","목사","목사님","전도사","신부님","수녀님","부처","스님","이슬람","힌두교","힌두","신천지","이만희","통일교","하나님","예수님","불교","18년","18놈","18새끼","ㄱㅐㅅㅐㄲl","ㄱㅐㅈㅏ","가슴만져","가슴빨아","가슴빨어","가슴조물락","가슴주물럭","가슴쪼물딱","가슴쪼물락","가슴핧아","가슴핧어","강간","개가튼년","개가튼뇬","개같은년","개걸레","개고치","개너미","개넘","개년","개놈","개늠","개똥","개떵","개떡","개라슥","개보지","개부달","개부랄","개불랄","개붕알","개새","개세","개쓰래기","개쓰레기","개씁년","개씁블","개씁자지","개씨발","개씨블","개자식","개자지","개잡년","개젓가튼넘","개좆","개지랄","개후라년","개후라들놈","개후라새끼","걔잡년","거시기","걸래년","걸레같은년","걸레년","걸레핀년","게부럴","게세끼","게이","게새끼","게늠","게자식","게지랄놈","고환","공지","공지사항","귀두","깨쌔끼","난자마셔","난자먹어","난자핧아","내꺼빨아","내꺼핧아","내버지","내자지","내잠지","내조지","너거애비","노옴","누나강간","니기미","니뿡","니뽕","니씨브랄","니아범","니아비","니애미","니애뷔","니애비","니할애비","닝기미","닌기미","니미","닳은년","덜은새끼","돈새끼","돌으년","돌은넘","돌은새끼","동생강간","동성애자","딸딸이","똥구녁","똥꾸뇽","똥구뇽","똥","띠발뇬","띠팔","띠펄","띠풀","띠벌","띠벨","띠빌","마스터","막간년","막대쑤셔줘","막대핧아줘","맛간년","맛없는년","맛이간년","멜리스","미친구녕","미친구멍","미친넘","미친년","미친놈","미친눔","미친새끼","미친쇄리","미친쇠리","미친쉐이","미친씨부랄","미튄","미티넘","미틴","미틴넘","미틴년","미틴놈","미틴것","백보지","버따리자지","버지구녕","버지구멍","버지냄새","버지따먹기","버지뚫어","버지뜨더","버지물마셔","버지벌려","버지벌료","버지빨아","버지빨어","버지썰어","버지쑤셔","버지털","버지핧아","버짓물","버짓물마셔","벌창같은년","벵신","병닥","병딱","병신","보쥐","보지","보지핧어","보짓물","보짓물마셔","봉알","부랄","불알","붕알","붜지","뷩딱","븅쉰","븅신","빙띤","빙신","빠가십새","빠가씹새","빠구리","빠굴이","뻑큐","뽕알","뽀지","뼝신","사까시","상년","새꺄","새뀌","새끼","색갸","색끼","색스","색키","샤발","서버","써글","써글년","성교","성폭행","세꺄","세끼","섹스","섹스하자","섹스해","섹쓰","섹히","수셔","쑤셔","쉐끼","쉑갸","쉑쓰","쉬발","쉬방","쉬밸년","쉬벌","쉬불","쉬붕","쉬빨","쉬이발","쉬이방","쉬이벌","쉬이불","쉬이붕","쉬이빨","쉬이팔","쉬이펄","쉬이풀","쉬팔","쉬펄","쉬풀","쉽쌔","시댕이","시발","시발년","시발놈","시발새끼","시방새","시밸","시벌","시불","시붕","시이발","시이벌","시이불","시이붕","시이팔","시이펄","시이풀","시팍새끼","시팔","시팔넘","시팔년","시팔놈","시팔새끼","시펄","실프","십8","십때끼","십떼끼","십버지","십부랄","십부럴","십새","십세이","십셰리","십쉐","십자석","십자슥","십지랄","십창녀","십창","십탱","십탱구리","십탱굴이","십팔새끼","ㅆㅂ","ㅆㅂㄹㅁ","ㅆㅂㄻ","ㅆㅣ","쌍넘","쌍년","쌍놈","쌍눔","쌍보지","쌔끼","쌔리","쌕스","쌕쓰","썅년","썅놈","썅뇬","썅늠","쓉새","쓰바새끼","쓰브랄쉽세","씌발","씌팔","씨가랭넘","씨가랭년","씨가랭놈","씨발","씨발년","씨발롬","씨발병신","씨방새","씨방세","씨밸","씨뱅가리","씨벌","씨벌년","씨벌쉐이","씨부랄","씨부럴","씨불","씨불알","씨붕","씨브럴","씨블","씨블년","씨븡새끼","씨빨","씨이발","씨이벌","씨이불","씨이붕","씨이팔","씨파넘","씨팍새끼","씨팍세끼","씨팔","씨펄","씨퐁넘","씨퐁뇬","씨퐁보지","씨퐁자지","씹년","씹물","씹미랄","씹버지","씹보지","씹부랄","씹브랄","씹빵구","씹뽀지","씹새","씹새끼","씹세","씹쌔끼","씹자석","씹자슥","씹자지","씹지랄","씹창","씹창녀","씹탱","씹탱굴이","씹탱이","씹팔","아가리","애무","애미","애미랄","애미보지","애미씨뱅","애미자지","애미잡년","애미좃물","애비","애자","양아치","어미강간","어미따먹자","어미쑤시자","영자","엄창","에미","에비","엔플레버","엠플레버","염병","염병할","염뵹","엿먹어라","오랄","오르가즘","왕버지","왕자지","왕잠지","왕털버지","왕털보지","왕털자지","왕털잠지","우미쑤셔","운디네","운영자","유두","유두빨어","유두핧어","유방","유방만져","유방빨아","유방주물럭","유방쪼물딱","유방쪼물럭","유방핧아","유방핧어","육갑","이그니스","이년","이프리트","자기핧아","자지","자지구녕","자지구멍","자지꽂아","자지넣자","자지뜨더","자지뜯어","자지박어","자지빨아","자지빨아줘","자지빨어","자지쑤셔","자지쓰레기","자지정개","자지짤라","자지털","자지핧아","자지핧아줘","자지핧어","작은보지","잠지","잠지뚫어","잠지물마셔","잠지털","잠짓물마셔","잡년","잡놈","저년","점물","젓가튼","젓가튼쉐이","젓같내","젓같은","젓까","젓나","젓냄새","젓대가리","젓떠","젓마무리","젓만이","젓물","젓물냄새","젓밥","정액마셔","정액먹어","정액발사","정액짜","정액핧아","정자마셔","정자먹어","정자핧아","젖같은","젖까","젖밥","젖탱이","조개넓은년","조개따조","조개마셔줘","조개벌려조","조개속물","조개쑤셔줘","조개핧아줘","조까","조또","족같내","족까","족까내","존나","존나게","존니","졸라","좀마니","좀물","좀쓰레기","좁빠라라","좃가튼뇬","좃간년","좃까","좃까리","좃깟네","좃냄새","좃넘","좃대가리","좃도","좃또","좃만아","좃만이","좃만한것","좃만한쉐이","좃물","좃물냄새","좃보지","좃부랄","좃빠구리","좃빠네","좃빠라라","좃털","좆같은놈","좆같은새끼","좆까","좆까라","좆나","좆년","좆도","좆만아","좆만한년","좆만한놈","좆만한새끼","좆먹어","좆물","좆밥","좆빨아","좆새끼","좆털","좋만한것","주글년","주길년","쥐랄","지랄","지랼","지럴","지뢀","쪼까튼","쪼다","쪼다새끼","찌랄","찌질이","창남","창녀","창녀버지","창년","처먹고","처먹을","쳐먹고","쳐쑤셔박어","촌씨브라리","촌씨브랑이","촌씨브랭이","크리토리스","큰보지","클리토리스","트랜스젠더","페니스","항문수셔","항문쑤셔","허덥","허버리년","허벌년","허벌보지","허벌자식","허벌자지","허접","허젚","허졉","허좁","헐렁보지","혀로보지핧기","호냥년","호로","호로새끼","호로자슥","호로자식","호로짜식","호루자슥","호모","호졉","호좁","후라덜넘","후장","후장꽂아","후장뚫어","흐접","흐젚","흐졉","bitch","fuck","fuckyou","nflavor","penis","pennis","pussy","sex"];  

    for (const word of banWords) {
      const regex = new RegExp(word, "gi");
      if (regex.test(str)) {
        return true;
      }
    }
    return false;
  }